NordicSemiconductor/nRF5-SDK-for-Mesh/models/config/src/config_server.c
/*
 * Sends a message with a status code as the first byte. All other bytes in the message is set to 0.
 * The total length of the message is as specified in the msg_size parameter.
 */
static void send_generic_error_reply(access_model_handle_t handle, const access_message_rx_t * p_message,
        access_status_t status, uint16_t status_opcode, uint16_t msg_size)
{
    uint8_t buffer[msg_size];
    memset(buffer, 0, msg_size);

    buffer[0] = status;
    send_reply(handle, p_message, status_opcode, buffer, msg_size, nrf_mesh_unique_token_get());
}

/* Sends the network beacon state in response to a network beacon state set/get message: */
static void send_net_beacon_state(access_model_handle_t handle, const access_message_rx_t * p_incoming)
{
    config_msg_net_beacon_status_t beacon_status =
    {
        .beacon_state = net_beacon_state_get() ? CONFIG_NET_BEACON_STATE_ENABLED : CONFIG_NET_BEACON_STATE_DISABLED
    };
    send_reply(handle, p_incoming, CONFIG_OPCODE_BEACON_STATUS,
               (const uint8_t *) &beacon_status, sizeof(beacon_status), nrf_mesh_unique_token_get());
}

/* Sends the appkey status in response to appkey manipulation functions: */
static void send_appkey_status(access_model_handle_t handle,
                               const access_message_rx_t * p_message,
                               access_status_t status,
                               config_msg_key_index_24_t key_indexes)
{
    const config_msg_appkey_status_t response =
    {
        .status = status,
        .key_indexes = key_indexes
    }; /*lint !e64 Lint incorrectly complains about a type mismach in this initializer. */
    send_reply(handle, p_message, CONFIG_OPCODE_APPKEY_STATUS,
               (const uint8_t *) &response, sizeof(response), nrf_mesh_unique_token_get());
}

/* Sends the publication status in response to publication messages. */
static void send_publication_status(access_model_handle_t this_handle, const access_message_rx_t * p_incoming,
        uint16_t element_address, access_model_handle_t model_handle)
{
    /* Build the publication status packet: */
    config_msg_publication_status_t response;
    uint32_t status;

    memset(&response.state, 0, sizeof(response.state));
    response.status = ACCESS_STATUS_SUCCESS;
    response.element_address = element_address;
    response.state.credential_flag = 0; /* FIXME: When friendship is supported, this bit can be used. */
    response.state.rfu = 0;

    /* Get the model ID: */
    access_model_id_t model_id;
    NRF_MESH_ASSERT(access_model_id_get(model_handle, &model_id) == NRF_SUCCESS);

    bool sig_model = model_id.company_id == ACCESS_COMPANY_ID_NONE;
    config_msg_model_id_set(&response.state.model_id, &model_id, sig_model);

    dsm_handle_t publish_address_handle;
    NRF_MESH_ASSERT(access_model_publish_address_get(model_handle, &publish_address_handle) == NRF_SUCCESS);

    if (publish_address_handle ==  DSM_HANDLE_INVALID)
    {
        /* If no publish address is set, the rest of the packet is set to 0: */
        response.publish_address = NRF_MESH_ADDR_UNASSIGNED;
    }
    else
    {
        /* Obtain the publish address: */
        nrf_mesh_address_t publish_address;
        NRF_MESH_ASSERT(dsm_address_get(publish_address_handle, &publish_address) == NRF_SUCCESS);
        response.publish_address = publish_address.value;

        /* Obtain the application key handle: */
        dsm_handle_t appkey_handle;
        status = access_model_publish_application_get(model_handle, &appkey_handle);

        if (status == NRF_ERROR_NOT_FOUND)
        {
            /* If model is not found, the rest of the packet is set to 0: */
            response.publish_address = NRF_MESH_ADDR_UNASSIGNED;
        }
        else if (status == NRF_SUCCESS)
        {
            /* Get the appkey index: */
            mesh_key_index_t appkey_index;
            status = dsm_appkey_handle_to_appkey_index(appkey_handle, &appkey_index);

            if (status == NRF_ERROR_NOT_FOUND)
            {
                /* If appkey is not found (possibly deleted), the rest of the packet is set to 0: */
                response.publish_address = NRF_MESH_ADDR_UNASSIGNED;
            }
            else if (status == NRF_SUCCESS)
            {
                response.state.appkey_index = appkey_index;

                /* Obtain the publish TTL: */
                (void ) access_model_publish_ttl_get(model_handle, &response.state.publish_ttl);

                /* Obtain the publish period: */
                access_publish_resolution_t publish_resolution;
                uint8_t publish_steps;

                memset(&publish_resolution, 0, sizeof(access_publish_resolution_t));
                (void) access_model_publish_period_get(model_handle, &publish_resolution, &publish_steps);

                /* Set the publish period in the message: */
                response.state.publish_period  = publish_resolution << ACCESS_PUBLISH_STEP_NUM_BITS | publish_steps;

                /* Set publish retransmit count and interval: */
                access_publish_retransmit_t publish_retransmit;
                (void) access_model_publish_retransmit_get(model_handle, &publish_retransmit);
                response.state.retransmit_count = publish_retransmit.count;             /* TODO: MBTLE-2388 */
                response.state.retransmit_interval = publish_retransmit.interval_steps; /* TODO: MBTLE-2388 */
            }
        }
        else
        {
            /* If this asserts, something is wrong */
            NRF_MESH_ASSERT(false);
        }
    }

    /* Finally send the message: */
    send_reply(this_handle, p_incoming, CONFIG_OPCODE_MODEL_PUBLICATION_STATUS, (const uint8_t *) &response,
            PACKET_LENGTH_WITH_ID(config_msg_publication_status_t, sig_model), nrf_mesh_unique_token_get());
}

/* Sends the publication error codes in response to publication messages. */
static void status_error_pub_send(access_model_handle_t this_handle, const access_message_rx_t * p_incoming,
                                      bool sig_model, uint8_t status_opcode)
{
    switch (p_incoming->opcode.opcode)
    {
        case CONFIG_OPCODE_MODEL_PUBLICATION_GET:
        case CONFIG_OPCODE_MODEL_PUBLICATION_SET:
        case CONFIG_OPCODE_MODEL_PUBLICATION_VIRTUAL_ADDRESS_SET:
        {
            /* Build the publication status packet: */
            config_msg_publication_status_t response;

