NordicSemiconductor/nRF5-SDK-for-Mesh/models/config/src/config_server.c
            memset(&response, 0, sizeof(config_msg_publication_status_t));
            response.status = status_opcode;
            response.state.credential_flag = 0; /* FIXME: When friendship is supported, this bit can be used. */

            switch(p_incoming->opcode.opcode)
            {
                case CONFIG_OPCODE_MODEL_PUBLICATION_GET:
                {
                    const config_msg_publication_get_t * p_pdu = (const config_msg_publication_get_t *) p_incoming->p_data;
                    response.element_address = p_pdu->element_address;
                    response.state.model_id = p_pdu->model_id;
                    break;
                }

                case CONFIG_OPCODE_MODEL_PUBLICATION_SET:
                {
                    const config_msg_publication_set_t * p_pdu = (const config_msg_publication_set_t *) p_incoming->p_data;
                    response.element_address = p_pdu->element_address;
                    response.state.model_id = p_pdu->state.model_id;
                    break;
                }

                case CONFIG_OPCODE_MODEL_PUBLICATION_VIRTUAL_ADDRESS_SET:
                {
                    const config_msg_publication_virtual_set_t * p_pdu = (const config_msg_publication_virtual_set_t *) p_incoming->p_data;
                    response.element_address = p_pdu->element_address;
                    response.state.model_id = p_pdu->state.model_id;
                    break;
                }

                default:
                    NRF_MESH_ASSERT(false);
                    break;
            }

            /* Finally send the message: */
            send_reply(this_handle, p_incoming, CONFIG_OPCODE_MODEL_PUBLICATION_STATUS, (const uint8_t *) &response,
                       PACKET_LENGTH_WITH_ID(config_msg_publication_status_t, sig_model), nrf_mesh_unique_token_get());
            break;
        }
    }
}

/* Sends the subscription error codes in response to subscription messages. */
static void status_error_sub_send(access_model_handle_t this_handle, const access_message_rx_t * p_incoming,
                                      bool sig_model, uint8_t status_opcode)
{
    switch (p_incoming->opcode.opcode)
    {
        case CONFIG_OPCODE_MODEL_SUBSCRIPTION_ADD:
        case CONFIG_OPCODE_MODEL_SUBSCRIPTION_DELETE:
        case CONFIG_OPCODE_MODEL_SUBSCRIPTION_OVERWRITE:
        case CONFIG_OPCODE_MODEL_SUBSCRIPTION_VIRTUAL_ADDRESS_ADD:
        case CONFIG_OPCODE_MODEL_SUBSCRIPTION_VIRTUAL_ADDRESS_DELETE:
        case CONFIG_OPCODE_MODEL_SUBSCRIPTION_VIRTUAL_ADDRESS_OVERWRITE:
        case CONFIG_OPCODE_MODEL_SUBSCRIPTION_DELETE_ALL:
        {
            /* Build the subscription status packet: */
            config_msg_subscription_status_t response;

            memset(&response, 0, sizeof(config_msg_subscription_status_t));
            response.status = status_opcode;

            switch(p_incoming->opcode.opcode)
            {
                case CONFIG_OPCODE_MODEL_SUBSCRIPTION_ADD:
                case CONFIG_OPCODE_MODEL_SUBSCRIPTION_DELETE:
                case CONFIG_OPCODE_MODEL_SUBSCRIPTION_OVERWRITE:
                {
                    const config_msg_subscription_add_del_owr_t * p_pdu = (const config_msg_subscription_add_del_owr_t *) p_incoming->p_data;
                    response.element_address = p_pdu->element_address;
                    response.address  = p_pdu->address;
                    response.model_id = p_pdu->model_id;
                    break;
                }

                case CONFIG_OPCODE_MODEL_SUBSCRIPTION_VIRTUAL_ADDRESS_ADD:
                case CONFIG_OPCODE_MODEL_SUBSCRIPTION_VIRTUAL_ADDRESS_DELETE:
                case CONFIG_OPCODE_MODEL_SUBSCRIPTION_VIRTUAL_ADDRESS_OVERWRITE:
                {
                    const config_msg_subscription_virtual_add_del_owr_t * p_pdu = (const config_msg_subscription_virtual_add_del_owr_t *) p_incoming->p_data;
                    response.element_address = p_pdu->element_address;
                    response.address = 0; /* Since incoming message does not have address field */
                    response.model_id = p_pdu->model_id;
                    break;
                }

                case CONFIG_OPCODE_MODEL_SUBSCRIPTION_DELETE_ALL:
                {
                    const config_msg_subscription_delete_all_t * p_pdu = (const config_msg_subscription_delete_all_t *) p_incoming->p_data;
                    response.element_address = p_pdu->element_address;
                    response.model_id = p_pdu->model_id;
                    break;
                }

                default:
                    NRF_MESH_ASSERT(false);
                    break;
            }

            send_reply(this_handle, p_incoming, CONFIG_OPCODE_MODEL_SUBSCRIPTION_STATUS, (const uint8_t *) &response,
                       PACKET_LENGTH_WITH_ID(config_msg_subscription_status_t, sig_model), nrf_mesh_unique_token_get());
            break;
        }

        case CONFIG_OPCODE_SIG_MODEL_SUBSCRIPTION_GET:
        {
            /* Build the subscription status packet: */
            config_msg_sig_model_subscription_list_t response;

            memset(&response, 0, sizeof(config_msg_sig_model_subscription_list_t));
            response.status = status_opcode;

            const config_msg_model_subscription_get_t * p_pdu = (const config_msg_model_subscription_get_t *) p_incoming->p_data;
            response.element_address = p_pdu->element_address;
            response.sig_model_id    = p_pdu->model_id.sig.model_id;

            send_reply(this_handle, p_incoming, CONFIG_OPCODE_SIG_MODEL_SUBSCRIPTION_LIST, (const uint8_t *) &response,
                       sizeof(config_msg_sig_model_subscription_list_t), nrf_mesh_unique_token_get());
            break;
        }

        case CONFIG_OPCODE_VENDOR_MODEL_SUBSCRIPTION_GET:
        {
            /* Build the subscription status packet: */
            config_msg_vendor_model_subscription_list_t response;

            memset(&response, 0, sizeof(config_msg_vendor_model_subscription_list_t));
            response.status = status_opcode;

            const config_msg_model_subscription_get_t * p_pdu = (const config_msg_model_subscription_get_t *) p_incoming->p_data;
            response.element_address = p_pdu->element_address;
            response.vendor_model_id = p_pdu->model_id.vendor.model_id;
            response.vendor_company_id = p_pdu->model_id.vendor.company_id;

