NordicSemiconductor/nRF5-SDK-for-Mesh/models/config/src/config_server.c
            m_heartbeat_publication.features     = hb_pub.features & HEARTBEAT_TRIGGER_TYPE_RFU_MASK;
            m_heartbeat_publication.netkey_index = hb_pub.netkey_index;

            heartbeat_publication_state_updated();

            status_message.status  = ACCESS_STATUS_SUCCESS;
        }
    }

    status_message.destination  =  p_pdu->destination;
    status_message.period_log   =  p_pdu->period_log;
    status_message.count_log    =  p_pdu->count_log;
    status_message.ttl          =  p_pdu->ttl;
    status_message.features     =  p_pdu->features & HEARTBEAT_TRIGGER_TYPE_RFU_MASK;
    status_message.netkey_index =  p_pdu->netkey_index;

    send_reply(handle, p_message, CONFIG_OPCODE_HEARTBEAT_PUBLICATION_STATUS,
              (const uint8_t *) &status_message, sizeof(status_message), nrf_mesh_unique_token_get());

    if (status_message.status == ACCESS_STATUS_SUCCESS)
    {
        const config_server_evt_t evt = {
            .type = CONFIG_SERVER_EVT_HEARTBEAT_PUBLICATION_SET,
            .params.heartbeat_publication_set.p_publication_state = &m_heartbeat_publication
        };
        app_evt_send(&evt);
    }
}

static void handle_heartbeat_subscription_get(access_model_handle_t handle, const access_message_rx_t * p_message, void * p_args)
{
    config_msg_heartbeat_subscription_status_t status_message;
    const heartbeat_subscription_state_t * p_hb_sub;

    /* Ignore messages with invalid length */
    if (p_message->length != 0)
    {
        return;
    }

    p_hb_sub = heartbeat_subscription_get();

    /* When the Heartbeat Subscription Source or Destination state is set to the unassigned address,
     the value of - the Source and Destination fields of the Status message shall be set to the
     unassigned address and the values of the CountLog, PeriodLog, MinHops, and MaxHops fields shall
     be set to 0x00. Refer to Mesh Profile Specification v1.0, section 4.4.1.2.16 */
    status_message.status = ACCESS_STATUS_SUCCESS;
    if (p_hb_sub->src == NRF_MESH_ADDR_UNASSIGNED ||
        p_hb_sub->dst == NRF_MESH_ADDR_UNASSIGNED)
    {
        status_message.source      = NRF_MESH_ADDR_UNASSIGNED;
        status_message.destination = NRF_MESH_ADDR_UNASSIGNED;
        status_message.period_log  = 0x00;
        status_message.count_log   = 0x00;
        status_message.min_hops    = 0x00;
        status_message.max_hops    = 0x00;
    }
    else
    {
        status_message.source      = p_hb_sub->src;
        status_message.destination = p_hb_sub->dst;
        status_message.count_log   = heartbeat_subscription_count_encode(p_hb_sub->count);
        status_message.period_log  = heartbeat_pubsub_period_encode(p_hb_sub->period);
        status_message.min_hops    = p_hb_sub->min_hops;
        status_message.max_hops    = p_hb_sub->max_hops;
    }

    send_reply(handle, p_message, CONFIG_OPCODE_HEARTBEAT_SUBSCRIPTION_STATUS,
               (const uint8_t *) &status_message, sizeof(status_message), nrf_mesh_unique_token_get());
}

static void handle_heartbeat_subscription_set(access_model_handle_t handle, const access_message_rx_t * p_message, void * p_args)
{
    config_msg_heartbeat_subscription_status_t status_message;
    const config_msg_heartbeat_subscription_set_t *p_pdu = (config_msg_heartbeat_subscription_set_t *) p_message->p_data;

    if (p_message->length != sizeof(config_msg_heartbeat_subscription_set_t))
    {
        return;
    }

    heartbeat_subscription_state_t new_subscription_state = {
        .src    = p_pdu->source,
        .dst    = p_pdu->destination,
        .period = heartbeat_pubsub_period_decode(p_pdu->period_log)
        /* other state values shall remain unchanged, see Mesh Profile Specification v1.0, section 4.4.1.2.16 */
    };

    if (heartbeat_subscription_set(&new_subscription_state) != NRF_SUCCESS)
    {
        return;
    }

    const heartbeat_subscription_state_t * p_hb_sub = heartbeat_subscription_get();

    status_message.status = ACCESS_STATUS_SUCCESS;
    status_message.source = p_hb_sub->src;
    status_message.destination = p_hb_sub->dst;
    status_message.period_log = heartbeat_pubsub_period_encode(p_hb_sub->period);
    status_message.count_log = heartbeat_subscription_count_encode(p_hb_sub->count);
    status_message.min_hops = p_hb_sub->min_hops;
    status_message.max_hops = p_hb_sub->max_hops;

    send_reply(handle, p_message, CONFIG_OPCODE_HEARTBEAT_SUBSCRIPTION_STATUS,
               (const uint8_t *) &status_message, sizeof(status_message), nrf_mesh_unique_token_get());

    const config_server_evt_t evt = {
        .type = CONFIG_SERVER_EVT_HEARTBEAT_SUBSCRIPTION_SET,
        .params.heartbeat_subscription_set.p_subscription_state = p_hb_sub
    };
    app_evt_send(&evt);
}

static void handle_model_app_bind_unbind(access_model_handle_t handle, const access_message_rx_t * p_message, void * p_args)
{
    if (!IS_PACKET_LENGTH_VALID_WITH_ID(config_msg_app_bind_unbind_t, p_message))
    {
        return;
    }

    const config_msg_app_bind_unbind_t * p_pdu = (const config_msg_app_bind_unbind_t *) p_message->p_data;
    access_model_id_t model_id;
    bool sig_model = model_id_extract(&model_id, &p_pdu->model_id, p_message, sizeof(config_msg_app_bind_unbind_t));

    config_msg_app_status_t response;
    response.status = ACCESS_STATUS_SUCCESS;
    response.element_address = p_pdu->element_address;
    response.appkey_index = p_pdu->appkey_index;
    response.model_id = p_pdu->model_id;

    access_model_handle_t model_handle;

    if (sig_model && model_id.model_id == CONFIG_SERVER_MODEL_ID)
    {
        response.status = ACCESS_STATUS_CANNOT_BIND;
        send_reply(handle, p_message, CONFIG_OPCODE_MODEL_APP_STATUS, (const uint8_t *) &response,
                PACKET_LENGTH_WITH_ID(config_msg_app_status_t, sig_model), nrf_mesh_unique_token_get());
        return;
    }

    uint16_t element_index = get_element_index(p_pdu->element_address);
    if (ACCESS_ELEMENT_INDEX_INVALID == element_index)
    {
        response.status = ACCESS_STATUS_INVALID_ADDRESS;
        send_reply(handle, p_message, CONFIG_OPCODE_MODEL_APP_STATUS, (const uint8_t *) &response,
                PACKET_LENGTH_WITH_ID(config_msg_app_status_t, sig_model), nrf_mesh_unique_token_get());
        return;
    }

    uint32_t status = access_handle_get(element_index, model_id, &model_handle);
    if (status != NRF_SUCCESS || (!sig_model && model_id.company_id == ACCESS_COMPANY_ID_NONE))
    {
        response.status = ACCESS_STATUS_INVALID_MODEL;
        send_reply(handle, p_message, CONFIG_OPCODE_MODEL_APP_STATUS, (const uint8_t *) &response,
                PACKET_LENGTH_WITH_ID(config_msg_app_status_t, sig_model), nrf_mesh_unique_token_get());
        return;
    }

    uint16_t appkey_index = p_pdu->appkey_index & CONFIG_MSG_KEY_INDEX_12_MASK;
    dsm_handle_t appkey_handle = dsm_appkey_index_to_appkey_handle(appkey_index);
    config_server_evt_t evt;

    if (p_message->opcode.opcode == CONFIG_OPCODE_MODEL_APP_BIND)
    {
        evt.type = CONFIG_SERVER_EVT_MODEL_APP_BIND;
        evt.params.model_app_bind.model_handle = model_handle;
        evt.params.model_app_bind.appkey_handle = appkey_handle;
        status = access_model_application_bind(model_handle, appkey_handle);
    }
    else
    {
        evt.type = CONFIG_SERVER_EVT_MODEL_APP_UNBIND;
        evt.params.model_app_unbind.model_handle = model_handle;
        evt.params.model_app_unbind.appkey_handle = appkey_handle;
        status = access_model_application_unbind(model_handle, appkey_handle);

        if (status == NRF_SUCCESS)
        {
            dsm_handle_t active_appkey_handle;
            NRF_MESH_ERROR_CHECK(access_model_publish_application_get(model_handle, &active_appkey_handle));
            if (active_appkey_handle == appkey_handle)
            {
                NRF_MESH_ERROR_CHECK(access_model_publication_stop(model_handle));
            }
        }
    }

    switch (status)
    {
        case NRF_SUCCESS:
            response.status = ACCESS_STATUS_SUCCESS;
            access_flash_config_store();
            break;
        case NRF_ERROR_NOT_FOUND:
            response.status = ACCESS_STATUS_INVALID_MODEL;
            break;
        case NRF_ERROR_INVALID_PARAM:
            response.status = ACCESS_STATUS_INVALID_APPKEY;
            break;
        default:
            response.status = ACCESS_STATUS_UNSPECIFIED_ERROR;
            break;
    }

    send_reply(handle, p_message, CONFIG_OPCODE_MODEL_APP_STATUS, (const uint8_t *) &response,
            PACKET_LENGTH_WITH_ID(config_msg_app_status_t, sig_model), nrf_mesh_unique_token_get());

