NordicSemiconductor/nRF5-SDK-for-Mesh/models/config/src/config_server.c
    /* Retrieve the appkey indexes from the DSM: */
    for (uint16_t i = 0; i < appkey_count; ++i)
    {
        NRF_MESH_ASSERT(dsm_appkey_handle_to_appkey_index(appkey_instances[i], &appkey_instances[i]) == NRF_SUCCESS);
    }

    uint8_t response_size = model_app_response_create(p_message->opcode.opcode,
                                                      response_buffer,
                                                      ACCESS_STATUS_SUCCESS,
                                                      p_pdu->element_address,
                                                      &model_id,
                                                      appkey_instances,
                                                      appkey_count);
    send_reply(handle, p_message, response_opcode, response_buffer, response_size, nrf_mesh_unique_token_get());
}

static void mesh_event_cb(const nrf_mesh_evt_t * p_evt)
{
    switch (p_evt->type)
    {
        case NRF_MESH_EVT_TX_COMPLETE:
            if (p_evt->params.tx_complete.token == m_reset_token &&
                NODE_RESET_PENDING == m_node_reset_pending)
            {
                /* Clear all the state. */
                mesh_stack_config_clear();
                if (flash_manager_is_stable())
                {
                    const config_server_evt_t evt = { .type = CONFIG_SERVER_EVT_NODE_RESET };
                    app_evt_send(&evt);
                    m_node_reset_pending = NODE_RESET_IDLE;
                }
                else
                {
                    m_node_reset_pending = NODE_RESET_FLASHING;
                }
            }
            break;

        case NRF_MESH_EVT_FLASH_STABLE:
            if (NODE_RESET_FLASHING == m_node_reset_pending)
            {
                const config_server_evt_t evt = { .type = CONFIG_SERVER_EVT_NODE_RESET };
                app_evt_send(&evt);
                m_node_reset_pending = NODE_RESET_IDLE;
            }
            break;

        default:
            break;
    }
}

/********** Opcode handler list *********/
static const access_opcode_handler_t opcode_handlers[] =
{
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_APPKEY_ADD)                                   , handle_appkey_add },
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_APPKEY_UPDATE)                                , handle_appkey_update },
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_MODEL_PUBLICATION_SET)                        , handle_config_model_publication_set },
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_APPKEY_DELETE)                                , handle_appkey_delete },
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_APPKEY_GET)                                   , handle_appkey_get },
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_COMPOSITION_DATA_GET)                         , handle_composition_data_get },
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_BEACON_GET)                                   , handle_config_beacon_get },
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_BEACON_SET)                                   , handle_config_beacon_set },
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_DEFAULT_TTL_GET)                              , handle_config_default_ttl_get },
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_DEFAULT_TTL_SET)                              , handle_config_default_ttl_set },
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_FRIEND_GET)                                   , handle_config_friend_get },
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_FRIEND_SET)                                   , handle_config_friend_set },
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_GATT_PROXY_GET)                               , handle_config_gatt_proxy_get },
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_GATT_PROXY_SET)                               , handle_config_gatt_proxy_set },
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_KEY_REFRESH_PHASE_GET)                        , handle_config_key_refresh_phase_get },
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_KEY_REFRESH_PHASE_SET)                        , handle_config_key_refresh_phase_set },
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_MODEL_PUBLICATION_GET)                        , handle_config_model_publication_get },
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_MODEL_PUBLICATION_VIRTUAL_ADDRESS_SET)        , handle_config_model_publication_set },
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_MODEL_SUBSCRIPTION_ADD)                       , handle_config_model_subscription_add },
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_MODEL_SUBSCRIPTION_DELETE)                    , handle_config_model_subscription_delete },
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_MODEL_SUBSCRIPTION_DELETE_ALL)                , handle_config_model_subscription_delete_all },
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_MODEL_SUBSCRIPTION_OVERWRITE)                 , handle_config_model_subscription_overwrite },
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_MODEL_SUBSCRIPTION_VIRTUAL_ADDRESS_ADD)       , handle_config_model_subscription_virtual_address_add },
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_MODEL_SUBSCRIPTION_VIRTUAL_ADDRESS_DELETE)    , handle_config_model_subscription_virtual_address_delete },
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_MODEL_SUBSCRIPTION_VIRTUAL_ADDRESS_OVERWRITE) , handle_config_model_subscription_virtual_address_overwrite },
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_RELAY_GET)                                    , handle_config_relay_get },
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_RELAY_SET)                                    , handle_config_relay_set },
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_SIG_MODEL_SUBSCRIPTION_GET)                   , handle_config_sig_model_subscription_get },
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_VENDOR_MODEL_SUBSCRIPTION_GET)                , handle_config_vendor_model_subscription_get },
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_HEARTBEAT_PUBLICATION_GET)                    , handle_heartbeat_publication_get },
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_HEARTBEAT_PUBLICATION_SET)                    , handle_heartbeat_publication_set },
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_HEARTBEAT_SUBSCRIPTION_GET)                   , handle_heartbeat_subscription_get },
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_HEARTBEAT_SUBSCRIPTION_SET)                   , handle_heartbeat_subscription_set },
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_MODEL_APP_BIND)                               , handle_model_app_bind_unbind },
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_MODEL_APP_UNBIND)                             , handle_model_app_bind_unbind },
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_NETKEY_ADD)                                   , handle_netkey_add_update },
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_NETKEY_UPDATE)                                , handle_netkey_add_update },
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_NETKEY_DELETE)                                , handle_netkey_delete },
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_NETKEY_GET)                                   , handle_netkey_get },
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_NODE_IDENTITY_GET)                            , handle_node_identity_get },
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_NODE_IDENTITY_SET)                            , handle_node_identity_set },
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_NODE_RESET)                                   , handle_node_reset },
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_SIG_MODEL_APP_GET)                            , handle_model_app_get },
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_VENDOR_MODEL_APP_GET)                         , handle_model_app_get },
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_NETWORK_TRANSMIT_GET)                         , handle_config_network_transmit_get},
    { ACCESS_OPCODE_SIG(CONFIG_OPCODE_NETWORK_TRANSMIT_SET)                         , handle_config_network_transmit_set},
};

uint32_t config_server_init(config_server_evt_cb_t evt_cb)
{
    const access_model_add_params_t init_params =
    {
        .model_id = {
            .model_id = CONFIG_SERVER_MODEL_ID,
            .company_id = ACCESS_COMPANY_ID_NONE
        },
        .element_index = 0,
        .p_opcode_handlers = opcode_handlers,
        .opcode_count = sizeof(opcode_handlers) / sizeof(access_opcode_handler_t)
    };

    nrf_mesh_evt_handler_add(&m_mesh_evt_handler);

    /* Install callback for the heartbeat module to enable it to fetch publication state information
    from the config server */
    heartbeat_config_server_cb_set(config_server_heartbeat_publication_params_get,
                                   config_server_heartbeat_publication_count_decrement);

#if !defined(UNIT_TEST)
    /* Ensure the model has not already been initialized. */
    NRF_MESH_ASSERT(m_config_server_handle == ACCESS_HANDLE_INVALID);
#endif

    m_evt_cb = evt_cb;
    return access_model_add(&init_params, &m_config_server_handle);
}

uint32_t config_server_bind(dsm_handle_t devkey_handle)
{
    return access_model_application_bind(m_config_server_handle, devkey_handle);
}
